These are more detailed instructions for reproducing:

Start Octopus locally with Docker Compose (saved to `compose.yml`):

```
services:
  octopus:
    privileged: true
    ports:
      - "8080:8080"
      - "10943:10943"
    environment:
      ADMIN_API_KEY: API-AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA
      ADMIN_USERNAME: admin
      ADMIN_EMAIL: octopusguides@gmail.com
      ADMIN_PASSWORD: Password01!
      ACCEPT_EULA: !!str "Y"
      DB_CONNECTION_STRING: Server=mssql,1433;Database=Octopus;User Id=SA;Password=Password01!;ConnectRetryCount=6
      CONNSTRING: Server=mssql,1433;Database=Octopus;User Id=SA;Password=Password01!;ConnectRetryCount=6
      MASTER_KEY: 6EdU6IWsCtMEwk0kPKflQQ==
    image: octopusdeploy/octopusdeploy:latest
    depends_on:
      - mssql
  mssql:
    environment:
      ACCEPT_EULA: Y
      SA_PASSWORD: Password01!
      MSSQL_PID: Express
    image: mcr.microsoft.com/mssql/server:2022-latest
```

Get the latest Docker image with:

```
docker pull octopusdeploy/octopusdeploy:latest
```

Start Octopus with:

```
docker compose up
```

Extract the example here into a directory:

[example.zip](https://github.com/user-attachments/files/18794037/example.zip)

Init Terraform with:

```
terraform init
```

Apply the terraform with:

```
terraform apply -var=octopus_server=http://localhost:8080 -var=octopus_apikey=API-AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA -var=octopus_space_id=Spaces-1
```

The full log output is this:

```
data.octopusdeploy_lifecycles.lifecycle_default_lifecycle: Reading...
data.octopusdeploy_feeds.built_in_feed: Reading...
data.octopusdeploy_lifecycles.lifecycle_default_lifecycle: Read complete after 0s [id=Lifecycles 2025-02-14 05:52:08.09616017 +0000 UTC]
data.octopusdeploy_feeds.built_in_feed: Read complete after 0s [id=Feeds 2025-02-14 05:52:08.104155902 +0000 UTC]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # octopusdeploy_deployment_freeze.freeze will be created
  + resource "octopusdeploy_deployment_freeze" "freeze" {
      + end   = "2024-12-27T00:00:00+08:00"
      + id    = (known after apply)
      + name  = "Xmas"
      + start = "2024-12-25T00:00:00+10:00"
    }

  # octopusdeploy_deployment_freeze_project.project_freeze will be created
  + resource "octopusdeploy_deployment_freeze_project" "project_freeze" {
      + deploymentfreeze_id = (known after apply)
      + environment_ids     = [
          + (known after apply),
        ]
      + id                  = (known after apply)
      + project_id          = (known after apply)
    }

  # octopusdeploy_deployment_process.test will be created
  + resource "octopusdeploy_deployment_process" "test" {
      + branch     = (known after apply)
      + id         = (known after apply)
      + project_id = (known after apply)
      + space_id   = (known after apply)
      + version    = (known after apply)

      + step {
          + condition            = "Success"
          + condition_expression = (known after apply)
          + id                   = (known after apply)
          + name                 = "Get MySQL Host"
          + package_requirement  = "LetOctopusDecide"
          + properties           = (known after apply)
          + start_trigger        = "StartAfterPrevious"
          + target_roles         = [
              + "eks",
            ]

          + action {
              + action_type                        = "Octopus.KubernetesRunScript"
              + can_be_used_for_project_versioning = true
              + channels                           = []
              + condition                          = "Success"
              + environments                       = []
              + excluded_environments              = []
              + features                           = []
              + id                                 = (known after apply)
              + is_disabled                        = false
              + is_required                        = false
              + name                               = "Get MySQL Host"
              + properties                         = {
                  + "Octopus.Action.KubernetesContainers.Namespace" = null
                  + "Octopus.Action.Script.ScriptBody"              = "echo \"hi\""
                  + "Octopus.Action.Script.ScriptSource"            = "Inline"
                  + "Octopus.Action.Script.Syntax"                  = "Bash"
                  + "OctopusUseBundledTooling"                      = "False"
                }
              + run_on_server                      = true
              + slug                               = (known after apply)
              + sort_order                         = -1
              + tenant_tags                        = []
                # (1 unchanged attribute hidden)

              + action_template (known after apply)

              + container (known after apply)

              + git_dependency (known after apply)

              + package {
                  + acquisition_location      = "Server"
                  + extract_during_deployment = false
                  + feed_id                   = "feeds-builtin"
                  + id                        = (known after apply)
                  + name                      = "package1"
                  + package_id                = "package1"
                  + properties                = {
                      + "Extract"       = "True"
                      + "Purpose"       = null
                      + "SelectionMode" = "immediate"
                    }
                }

              + primary_package (known after apply)
            }
        }
    }

  # octopusdeploy_environment.development_environment will be created
  + resource "octopusdeploy_environment" "development_environment" {
      + allow_dynamic_infrastructure = true
      + description                  = "A test environment"
      + id                           = (known after apply)
      + name                         = "Development"
      + slug                         = (known after apply)
      + sort_order                   = (known after apply)
      + space_id                     = (known after apply)
      + use_guided_failure           = false

      + jira_extension_settings {
          + environment_type = "unmapped"
        }

      + jira_service_management_extension_settings {
          + is_enabled = true
        }

      + servicenow_extension_settings {
          + is_enabled = true
        }
    }

  # octopusdeploy_environment.production_environment will be created
  + resource "octopusdeploy_environment" "production_environment" {
      + allow_dynamic_infrastructure = true
      + description                  = "A test environment"
      + id                           = (known after apply)
      + name                         = "Production"
      + slug                         = (known after apply)
      + sort_order                   = (known after apply)
      + space_id                     = (known after apply)
      + use_guided_failure           = false
    }

  # octopusdeploy_environment.test_environment will be created
  + resource "octopusdeploy_environment" "test_environment" {
      + allow_dynamic_infrastructure = true
      + description                  = "A test environment"
      + id                           = (known after apply)
      + name                         = "Test"
      + slug                         = (known after apply)
      + sort_order                   = (known after apply)
      + space_id                     = (known after apply)
      + use_guided_failure           = false
    }

  # octopusdeploy_project.deploy_frontend_project will be created
  + resource "octopusdeploy_project" "deploy_frontend_project" {
      + auto_create_release                  = false
      + default_guided_failure_mode          = "EnvironmentDefault"
      + default_to_skip_if_already_installed = false
      + deployment_changes_template          = (known after apply)
      + deployment_process_id                = (known after apply)
      + description                          = "Test project"
      + discrete_channel_release             = false
      + id                                   = (known after apply)
      + included_library_variable_sets       = []
      + is_disabled                          = false
      + is_discrete_channel_release          = false
      + is_version_controlled                = false
      + lifecycle_id                         = "Lifecycles-1"
      + name                                 = "Test"
      + project_group_id                     = (known after apply)
      + release_notes_template               = (known after apply)
      + slug                                 = (known after apply)
      + space_id                             = "Spaces-1"
      + tenanted_deployment_participation    = "Untenanted"
      + variable_set_id                      = (known after apply)

      + connectivity_policy {
          + allow_deployments_to_no_targets = false
          + exclude_unhealthy_targets       = false
          + skip_machine_behavior           = "SkipUnavailableMachines"
          + target_roles                    = (known after apply)
        }

      + versioning_strategy {
          + template = "#{Octopus.Version.LastMajor}.#{Octopus.Version.LastMinor}.#{Octopus.Version.LastPatch}.#{Octopus.Version.NextRevision}"
        }
    }

  # octopusdeploy_project_group.project_group_test will be created
  + resource "octopusdeploy_project_group" "project_group_test" {
      + description = "Test Description"
      + id          = (known after apply)
      + name        = "Test"
      + space_id    = (known after apply)
    }

  # octopusdeploy_runbook.runbook will be created
  + resource "octopusdeploy_runbook" "runbook" {
      + default_guided_failure_mode   = "EnvironmentDefault"
      + description                   = "Test Runbook"
      + environment_scope             = "Specified"
      + environments                  = [
          + (known after apply),
        ]
      + force_package_download        = false
      + id                            = (known after apply)
      + multi_tenancy_mode            = "Untenanted"
      + name                          = "Runbook"
      + project_id                    = (known after apply)
      + published_runbook_snapshot_id = (known after apply)
      + runbook_process_id            = (known after apply)
      + space_id                      = (known after apply)

      + connectivity_policy {
          + allow_deployments_to_no_targets = false
          + exclude_unhealthy_targets       = false
          + skip_machine_behavior           = "SkipUnavailableMachines"
          + target_roles                    = (known after apply)
        }

      + retention_policy {
          + quantity_to_keep    = 10
          + should_keep_forever = false
        }
    }

  # octopusdeploy_runbook_process.runbook will be created
  + resource "octopusdeploy_runbook_process" "runbook" {
      + id         = (known after apply)
      + project_id = (known after apply)
      + runbook_id = (known after apply)
      + space_id   = (known after apply)
      + version    = (known after apply)

      + step {
          + condition            = "Success"
          + condition_expression = (known after apply)
          + id                   = (known after apply)
          + name                 = "Hello world (using PowerShell)"
          + package_requirement  = "LetOctopusDecide"
          + properties           = (known after apply)
          + start_trigger        = "StartAfterPrevious"
          + target_roles         = []

          + action {
              + action_type                        = "Octopus.Script"
              + can_be_used_for_project_versioning = false
              + channels                           = []
              + condition                          = "Success"
              + environments                       = (known after apply)
              + excluded_environments              = []
              + features                           = [
                  + "Octopus.Features.JsonConfigurationVariables",
                ]
              + id                                 = (known after apply)
              + is_disabled                        = false
              + is_required                        = true
              + name                               = "Hello world (using PowerShell)"
              + properties                         = {
                  + "Octopus.Action.Script.ScriptBody"   = <<-EOT
                        Write-Host 'Hello world, using PowerShell'
                        
                        #TODO: Experiment with steps of your own :)
                        
                        Write-Host '[Learn more about the types of steps available in Octopus](https://oc.to/OnboardingAddStepsLearnMore)'
                    EOT
                  + "Octopus.Action.Script.ScriptSource" = "Inline"
                  + "Octopus.Action.Script.Syntax"       = "PowerShell"
                }
              + run_on_server                      = true
              + slug                               = (known after apply)
              + sort_order                         = -1
              + tenant_tags                        = []
                # (1 unchanged attribute hidden)

              + action_template (known after apply)

              + container (known after apply)

              + git_dependency (known after apply)

              + package {
                  + acquisition_location      = "Server"
                  + extract_during_deployment = false
                  + feed_id                   = "feeds-builtin"
                  + id                        = (known after apply)
                  + name                      = "package1"
                  + package_id                = "package1"
                  + properties                = {
                      + "Extract"       = "True"
                      + "Purpose"       = null
                      + "SelectionMode" = "immediate"
                    }
                }

              + primary_package (known after apply)
            }
        }
      + step {
          + condition            = "Success"
          + condition_expression = (known after apply)
          + id                   = (known after apply)
          + name                 = "Test"
          + package_requirement  = "LetOctopusDecide"
          + properties           = (known after apply)
          + start_trigger        = "StartAfterPrevious"
          + target_roles         = []

          + action {
              + action_type                        = "Octopus.TerraformApply"
              + can_be_used_for_project_versioning = false
              + channels                           = []
              + condition                          = "Success"
              + environments                       = []
              + excluded_environments              = []
              + features                           = []
              + id                                 = (known after apply)
              + is_disabled                        = false
              + is_required                        = false
              + name                               = "Test"
              + properties                         = {
                  + "Octopus.Action.GoogleCloud.ImpersonateServiceAccount"  = "False"
                  + "Octopus.Action.GoogleCloud.UseVMServiceAccount"        = "True"
                  + "Octopus.Action.Package.DownloadOnTentacle"             = "False"
                  + "Octopus.Action.Script.ScriptSource"                    = "Package"
                  + "Octopus.Action.Terraform.AllowPluginDownloads"         = "True"
                  + "Octopus.Action.Terraform.AzureAccount"                 = "False"
                  + "Octopus.Action.Terraform.GoogleCloudAccount"           = "False"
                  + "Octopus.Action.Terraform.ManagedAccount"               = "None"
                  + "Octopus.Action.Terraform.PlanJsonOutput"               = "False"
                  + "Octopus.Action.Terraform.RunAutomaticFileSubstitution" = "True"
                  + "Octopus.Action.Terraform.TemplateDirectory"            = "blah"
                }
              + run_on_server                      = true
              + slug                               = (known after apply)
              + sort_order                         = -1
              + tenant_tags                        = []
                # (2 unchanged attributes hidden)

              + action_template (known after apply)

              + container (known after apply)

              + git_dependency (known after apply)

              + package (known after apply)

              + primary_package {
                  + acquisition_location = "Server"
                  + feed_id              = "feeds-builtin"
                  + id                   = (known after apply)
                  + package_id           = "terraform"
                  + properties           = {
                      + "SelectionMode" = "immediate"
                    }
                }
            }
        }
    }

  # octopusdeploy_variable.string_variable will be created
  + resource "octopusdeploy_variable" "string_variable" {
      + id           = (known after apply)
      + is_editable  = true
      + is_sensitive = false
      + name         = "Test"
      + owner_id     = (known after apply)
      + space_id     = (known after apply)
      + type         = "String"
      + value        = "PlainText"
        # (1 unchanged attribute hidden)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + octopus_space_id = "Spaces-1"
╷
│ Warning: Block Deprecated
│ 
│   with octopusdeploy_project.deploy_frontend_project,
│   on project.tf line 23, in resource "octopusdeploy_project" "deploy_frontend_project":
│   23: resource "octopusdeploy_project" "deploy_frontend_project" {
│ 
│ octopusdeploy_project.versioning_strategy is deprecated in favor of resource octopusdeploy_project_versioning_strategy. See
│ https://oc.to/deprecation-tfp-project-versioning-strategy for more info and migration guidance.
│ 
│ (and one more similar warning elsewhere)
╵
╷
│ Warning: This action type has its own explicit action type
│ 
│   with octopusdeploy_deployment_process.test,
│   on project.tf line 59, in resource "octopusdeploy_deployment_process" "test":
│   59:       action_type                        = "Octopus.KubernetesRunScript"
│ 
│ Please use the new "run_kubectl_script_action" instead of the generic "action".
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

octopusdeploy_project_group.project_group_test: Creating...
octopusdeploy_deployment_freeze.freeze: Creating...
octopusdeploy_environment.test_environment: Creating...
octopusdeploy_environment.production_environment: Creating...
octopusdeploy_environment.development_environment: Creating...
octopusdeploy_project_group.project_group_test: Creation complete after 0s [id=ProjectGroups-2]
octopusdeploy_project.deploy_frontend_project: Creating...
octopusdeploy_environment.test_environment: Creation complete after 0s [id=Environments-1]
octopusdeploy_environment.production_environment: Creation complete after 0s [id=Environments-2]
octopusdeploy_environment.development_environment: Creation complete after 0s [id=Environments-3]
octopusdeploy_project.deploy_frontend_project: Creation complete after 1s [id=Projects-1]
octopusdeploy_variable.string_variable: Creating...
octopusdeploy_runbook.runbook: Creating...
octopusdeploy_deployment_process.test: Creating...
octopusdeploy_runbook.runbook: Creation complete after 0s [id=Runbooks-1]
octopusdeploy_runbook_process.runbook: Creating...
octopusdeploy_variable.string_variable: Creation complete after 0s [id=35496603-b70a-47b4-b089-47cb9ab21543]
octopusdeploy_deployment_process.test: Creation complete after 0s [id=deploymentprocess-Projects-1]
octopusdeploy_runbook_process.runbook: Creation complete after 0s [id=RunbookProcess-Runbooks-1]
╷
│ Warning: Block Deprecated
│ 
│   with octopusdeploy_project.deploy_frontend_project,
│   on project.tf line 23, in resource "octopusdeploy_project" "deploy_frontend_project":
│   23: resource "octopusdeploy_project" "deploy_frontend_project" {
│ 
│ octopusdeploy_project.versioning_strategy is deprecated in favor of resource octopusdeploy_project_versioning_strategy. See
│ https://oc.to/deprecation-tfp-project-versioning-strategy for more info and migration guidance.
╵
╷
│ Warning: This action type has its own explicit action type
│ 
│   with octopusdeploy_deployment_process.test,
│   on project.tf line 59, in resource "octopusdeploy_deployment_process" "test":
│   59:       action_type                        = "Octopus.KubernetesRunScript"
│ 
│ Please use the new "run_kubectl_script_action" instead of the generic "action".
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Error: error while creating deployment freeze
│ 
│   with octopusdeploy_deployment_freeze.freeze,
│   on freeze.tf line 1, in resource "octopusdeploy_deployment_freeze" "freeze":
│    1: resource "octopusdeploy_deployment_freeze" "freeze" {
│ 
│ Octopus API error: There was a problem with your request. [The ProjectEnvironmentScope field is required.]
```
